--------------------------------------------------------
--  파일이 생성됨 - 목요일-12월-19-2019   
--------------------------------------------------------
-- 내부 생성기를 시도하는 DBMS_METADATA로 SCAL.내장메모리 객체에 대한 TABLE DDL을 렌더링할 수 없습니다.
CREATE TABLE 내장메모리 
(
  기종번호 VARCHAR2(5 BYTE) NOT NULL 
, 용량 NUMBER NOT NULL 
, 현재공시지원금 NUMBER 
, 현재출고가 NUMBER 
, 등록수 NUMBER 
, 공시지원금변화치 NUMBER 
, 출고가변화치 NUMBER 
) 
LOGGING 
TABLESPACE SYSTEM 
PCTFREE 10 
PCTUSED 40 
INITRANS 1 
STORAGE 
( 
  INITIAL 65536 
  NEXT 1048576 
  MINEXTENTS 1 
  MAXEXTENTS UNLIMITED 
  FREELISTS 1 
  FREELIST GROUPS 1 
  BUFFER_POOL DEFAULT 
) 
NOPARALLELCREATE UNIQUE INDEX 내장메모리_PK ON 내장메모리 (기종번호 ASC, 용량 ASC) 
LOGGING 
TABLESPACE SYSTEM 
PCTFREE 10 
INITRANS 2 
STORAGE 
( 
  INITIAL 65536 
  NEXT 1048576 
  MINEXTENTS 1 
  MAXEXTENTS UNLIMITED 
  FREELISTS 1 
  FREELIST GROUPS 1 
  BUFFER_POOL DEFAULT 
) 
NOPARALLELALTER TABLE 내장메모리
ADD CONSTRAINT FK_내장메모리_기종 FOREIGN KEY
(
  기종번호 
)
REFERENCES 기종
(
  기종번호 
)
ENABLEALTER TABLE 내장메모리
ADD CONSTRAINT 내장메모리_PK PRIMARY KEY 
(
  기종번호 
, 용량 
)
USING INDEX 내장메모리_PK
ENABLE
REM INSERTING into SCAL."내장메모리"
SET DEFINE OFF;
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0001',256,350000,1248500,0,0,-100000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0002',512,350000,1397000,0,0,-20000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0003',512,450000,899800,0,-100000,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0004',128,450000,1199000,1,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0005',256,350000,1199000,0,0,-30000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0006',128,250000,899800,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0007',128,70000,1656000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0008',256,70000,1584000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0009',64,70000,1529000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0010',128,70000,858000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0011',64,140000,1049400,0,-10000,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0012',64,300000,1110338,0,-10000,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0013',64,70000,1180000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0014',128,70000,1108000,0,0,-35000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0015',128,70000,899800,0,0,-200000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0016',512,400000,1397000,1,-50000,-10000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0017',512,450000,1094500,1,-50000,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0018',128,140000,869000,0,-50000,-30000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0019',128,70000,897600,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0020',32,600000,352000,1,-10000,-50000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0021',128,70000,599500,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0002',256,72000,1496000,0,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0007',64,350000,990000,0,0,-100000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0008',64,70000,1375000,0,0,-5000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0014',64,70000,990000,0,0,-10000);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0016',128,70000,1155000,1,0,0);
Insert into SCAL."내장메모리" ("기종번호","용량","현재공시지원금","현재출고가","등록수","공시지원금변화치","출고가변화치") values ('0017',128,140000,995500,0,0,0);
-- 내부 생성기를 시도하는 DBMS_METADATA로 SCAL.내장메모리_PK 객체에 대한 INDEX DDL을 렌더링할 수 없습니다.
CREATE UNIQUE INDEX 내장메모리_PK ON 내장메모리 (기종번호 ASC, 용량 ASC) 
LOGGING 
TABLESPACE SYSTEM 
PCTFREE 10 
INITRANS 2 
STORAGE 
( 
  INITIAL 65536 
  NEXT 1048576 
  MINEXTENTS 1 
  MAXEXTENTS UNLIMITED 
  FREELISTS 1 
  FREELIST GROUPS 1 
  BUFFER_POOL DEFAULT 
) 
NOPARALLEL
